{"release_id": "95acc0d8dfb69bfe", "title": "IRS statements and announcements", "url": "https://www.irs.gov/newsroom/irs-statements-and-announcements", "published_date": "2024-10-15", "content_summary": "IRS statements and announcements", "full_content": "An official website of the United States government A .gov website belongs to an official government organization in the United States. A lock ( )\n            or https:// means you've safely connected to the .gov website. Share sensitive information only on official, secure websites. Oct. 1, 2025 — The IRS will continue operations under the current lapse in appropriations through midnight on Tuesday, Oct. 7, using funding from 2022 legislation. June 12, 2025 — The IRS is aware that there is a delay in processing some electronic payments, and that some taxpayers are receiving IRS notices indicating a balance due even though payments were made timely. Sept. 11, 2024 — The Internal Revenue Service has posted an early DRAFT of the instructions to filers of Form 1099-DA, which is the form digital asset brokers are expected to use to report certain sale and/or exchange of digital assets beginning in calendar year 2025. Aug. 16, 2024 — Dozens of organizations across the nation’s tax industry as well as state tax agencies have endorsed the Coalition Against Scam and Scheme Threats or CASST cooperative approach. June 12, 2024 — The IRS is aware that some taxpayers are receiving CP14 (Balance Due, No Math Error) notices indicating a balance due even though payments were made with their 2023 tax return. May 14, 2024 — The IRS understands the importance of child support payments in helping families make ends meet, and we continue to work hard to prevent any disruption to these vital payments related to federal tax refund offsets. May 10, 2024 — IRS statement to taxpayers receiving Letter 6613 alerting them to the unauthorized disclosure of tax return information by an IRS contractor. May 10, 2024 — During the past year, the IRS has taken dramatic steps to strengthen our internal systems, protocols and procedures by putting in place numerous improvements to bolster protection of key systems and information. May 8, 2024 — This week, the Treasury Department and the IRS released pr", "tax_amounts_json": "[]", "effective_dates": "[\"June\", \"2024\", \"2023\", \"2022\", \"2025\", \"2006\", \"March\", \"May\"]", "linked_revproc_url": null, "keywords_matched": "[]", "is_inflation_related": false, "is_tax_year_update": false, "jurisdiction_level": "federal", "jurisdiction_code": "US", "_extracted_at": "2025-10-16T20:58:02.532990Z", "_source_url": "https://www.irs.gov/newsroom"}
{"release_id": "2a1f0502e9feaf57", "title": "IRS hires new Associate Chief Counsel to focus on partnerships and other passthrough entities", "url": "https://www.irs.gov/newsroom/irs-hires-new-associate-chief-counsel-to-focus-on-partnerships-and-other-passthrough-entities", "published_date": "2024-10-15", "content_summary": "IRS hires new Associate Chief Counsel to focus on partnerships and other passthrough entities", "full_content": "An official website of the United States government A .gov website belongs to an official government organization in the United States. A lock ( )\n            or https:// means you've safely connected to the .gov website. Share sensitive information only on official, secure websites. WASHINGTON — The Internal Revenue Service today announced the selection of the first Associate Chief Counsel for the newly created Passthroughs, Trusts and Estates office that will focus exclusively on partnerships, S corporations, trusts and estates. Staffing for this office will be drawn from the current Passthroughs and Special Industries office. The new Associate Chief Counsel, Jeffrey Erickson, is expected to join the IRS in January 2025. Most recently, he served as a Principal in Ernst & Young’s National Tax Passthroughs Transaction Group. Holly Porter will be the Associate Chief Counsel for the Energy, Credits, and Excise Tax office, which also will be drawn from the current Passthroughs and Special Industries office. “We are excited that Jeff will be returning to the IRS to lead Chief Counsel’s work in this priority area,” said IRS Chief Counsel Margie Rollinson. “He will bring an extensive background in tax law that encompasses over 30 years of experience in both the federal government and the private sector.” As the Associate Chief Counsel for Passthroughs, Trusts and Estates, Erickson will coordinate and direct the activities of the office and oversee legal advisory services that support the uniform interpretation, application, enforcement and litigation of tax laws involving partnerships, S corporations, trusts and estates. Erickson began his tax career in 1991 as an Attorney Advisor at the IRS’s Office of Chief Counsel in Passthroughs and Special Industries and left the IRS in 1999 as an Assistant Branch Chief. Additionally, Erickson has served as an Adjunct Professor at the Georgetown University Law Center, where he co-taught Taxation of Partnerships for LL.M. and J.D. stu", "tax_amounts_json": "[]", "effective_dates": "[\"2025\"]", "linked_revproc_url": null, "keywords_matched": "[]", "is_inflation_related": false, "is_tax_year_update": false, "jurisdiction_level": "federal", "jurisdiction_code": "US", "_extracted_at": "2025-10-16T20:58:02.533034Z", "_source_url": "https://www.irs.gov/newsroom"}
{"release_id": "d4ac584fafc4e09c", "title": "National Cybersecurity Awareness Month reminder: IRS and Security Summit supply online safety tips", "url": "https://www.irs.gov/newsroom/national-cybersecurity-awareness-month-reminder-irs-and-security-summit-supply-online-safety-tips", "published_date": "2024-10-15", "content_summary": "National Cybersecurity Awareness Month reminder: IRS and Security Summit supply online safety tips", "full_content": "An official website of the United States government A .gov website belongs to an official government organization in the United States. A lock ( )\n            or https:// means you've safely connected to the .gov website. Share sensitive information only on official, secure websites. WASHINGTON — As National Cybersecurity Awareness Month concludes and preparation for next tax season begins, the Internal Revenue Service and its Security Summit partners today reminded taxpayers to be wary of online threats like identity theft and fraud. Whether shopping online or browsing social media, people unfamiliar with online security could be putting themselves at risk. Lax online behavior can open the door to swindlers eager to swipe people’s personal information and leave themselves vulnerable to tax-related identity theft. The IRS and Security Summit alert taxpayers to remain vigilant and to teach children and teens how to recognize and avoid online scams to minimize their chances of falling prey or unwittingly exposing their families to identity theft and tax fraud. The public-private sector partnership encourages everyone to be aware of the many security vulnerabilities they face online and to review a wide range of resources available to them as October’s National Cybersecurity Awareness Month draws to a close. Members of the Security Summit – a coalition that includes tax software and financial companies, tax professionals, state tax administrators and the IRS – also offer multiple online safety recommendations to protect taxpayers from tax-related identity theft. Options to help protect against cybersecurity attacks include: ", "tax_amounts_json": "[]", "effective_dates": "[]", "linked_revproc_url": null, "keywords_matched": "[]", "is_inflation_related": false, "is_tax_year_update": false, "jurisdiction_level": "federal", "jurisdiction_code": "US", "_extracted_at": "2025-10-16T20:58:02.533037Z", "_source_url": "https://www.irs.gov/newsroom"}
{"release_id": "42794c145f7ad89d", "title": "IRS relief now available to flood victims in the Juneau area; multiple deadlines postponed to May 1, 2025", "url": "https://www.irs.gov/newsroom/irs-relief-now-available-to-flood-victims-in-the-juneau-area-multiple-deadlines-postponed-to-may-1-2025", "published_date": "2024-10-15", "content_summary": "IRS relief now available to flood victims in the Juneau area; multiple deadlines postponed to May 1, 2025", "full_content": "An official website of the United States government A .gov website belongs to an official government organization in the United States. A lock ( )\n            or https:// means you've safely connected to the .gov website. Share sensitive information only on official, secure websites. WASHINGTON — The Internal Revenue Service today announced disaster tax relief for individuals and businesses in the Juneau area of Alaska, affected by flooding that began on Aug. 5, 2024. Affected taxpayers now have until May 1, 2025, to file various federal individual and business tax returns and make tax payments. The IRS is offering relief to any area designated by the Federal Emergency Management Agency (FEMA) . Currently, this includes the City and Borough of Juneau in Alaska. Individuals and households that reside or have a business in this locality qualify for tax relief. The same relief will be available to any other localities added later to the disaster area. The current list of eligible localities is always available on the Tax relief in disaster situations page on IRS.gov. The tax relief postpones various tax filing and payment deadlines that occurred beginning on Aug. 5, 2024, and end on May 1, 2025 (postponement period). As a result, affected individuals and businesses will have until May 1, 2025, to file returns and pay any taxes that were originally due during this period. This means, for example, that the May 1, 2025, deadline will now apply to: In addition, penalties for failing to make payroll and excise tax deposits due on or after Aug. 5, 2024, and before Aug. 20, 2024, will be abated, as long as the deposits were made by Aug. 20, 2024. The Disaster assistance and emergency relief for individuals and businesses page has details on other returns, payments and tax-related actions qualifying for relief during the postponement period. The IRS automatically provides filing and penalty relief to any taxpayer with an IRS address of record located in the disaster area. Thes", "tax_amounts_json": "[]", "effective_dates": "[\"2025\", \"2023\", \"2024\", \"May\"]", "linked_revproc_url": null, "keywords_matched": "[]", "is_inflation_related": false, "is_tax_year_update": true, "jurisdiction_level": "federal", "jurisdiction_code": "US", "_extracted_at": "2025-10-16T20:58:02.533040Z", "_source_url": "https://www.irs.gov/newsroom"}
{"release_id": "1159a3661651edc4", "title": "Treasury, IRS issue final regulations for the Advanced Manufacturing Production Credit", "url": "https://www.irs.gov/newsroom/treasury-irs-issue-final-regulations-for-the-advanced-manufacturing-production-credit", "published_date": "2024-10-15", "content_summary": "Treasury, IRS issue final regulations for the Advanced Manufacturing Production Credit", "full_content": "An official website of the United States government A .gov website belongs to an official government organization in the United States. A lock ( )\n            or https:// means you've safely connected to the .gov website. Share sensitive information only on official, secure websites. WASHINGTON — The Department of the Treasury and the Internal Revenue Service today issued final regulations to provide guidance for the Advanced Manufacturing Production Credit established by the Inflation Reduction Act of 2022 (IRA). The Advanced Manufacturing Production Credit provides a tax credit for the production and sale of statutorily specified eligible components to unrelated persons. Such eligible components include solar and wind energy components, inverters, qualifying battery components and 50 applicable critical minerals. The eligible components must be produced in the United States or a territory of the United States. Generally, the final regulations define qualifying production activities, provide rules for the sale of eligible components to unrelated persons as well as special rules that apply to sales between related persons, and provide rules to address contract manufacturing scenarios. The final regulations also provide definitions of eligible components, rules related to calculating the credit, including eligible production costs, and specific recordkeeping and reporting requirements. More information about IRA guidance may be found on the Inflation Reduction Act of 2022 page on IRS.gov. ", "tax_amounts_json": "[]", "effective_dates": "[\"2022\"]", "linked_revproc_url": null, "keywords_matched": "[]", "is_inflation_related": false, "is_tax_year_update": false, "jurisdiction_level": "federal", "jurisdiction_code": "US", "_extracted_at": "2025-10-16T20:58:02.533041Z", "_source_url": "https://www.irs.gov/newsroom"}
{"release_id": "0d0412653ff6a7ad", "title": "Treasury and IRS issue guidance for the Energy Efficient Home Improvement Credit", "url": "https://www.irs.gov/newsroom/treasury-and-irs-issue-guidance-for-the-energy-efficient-home-improvement-credit", "published_date": "2024-10-15", "content_summary": "Treasury and IRS issue guidance for the Energy Efficient Home Improvement Credit", "full_content": "An official website of the United States government A .gov website belongs to an official government organization in the United States. A lock ( )\n            or https:// means you've safely connected to the .gov website. Share sensitive information only on official, secure websites. WASHINGTON — The Department of the Treasury and the Internal Revenue Service today issued Revenue Procedure 2024-31 PDF and proposed regulations to provide guidance for the Energy Efficient Home Improvement Credit. The revenue procedure provides procedures and requirements that a manufacturer of specified property must follow to be treated as a qualified manufacturer (QM). To become a QM, a manufacturer must: Soon manufacturers will be able to use IRS Energy Credits Online Portal (IRS ECO) to register with the IRS. IRS ECO is a free electronic service that is secure and requires no special software, making it accessible to large and small businesses alike. Manufacturers of qualifying products can use the IRS ECO platform to register and provide information to the IRS for filing purposes. In addition, IRS ECO incorporates validation checks and other risk-mitigation measures and allows for monitoring in real time of key metrics to include identification of customer-service enhancements and fraudulent activity. For property placed in service beginning in 2023, a taxpayer may take a credit equal to 30% of the total amount paid for certain energy efficient products or for a home energy audit. The credit is limited to certain amounts, per taxpayer and per tax year. A taxpayer may claim a total credit of up to $3,200, with a general total limit of $1,200, and a separate total limit of $2,000 for electric or natural gas heat pump water heaters, electric or natural gas heat pumps, and biomass stoves or boilers that meet certain requirements. The $1,200 general limit also includes additional limitations specific to certain types of property that meet the requirements: Beginning in 2025, for each ", "tax_amounts_json": "[{\"amount\": 3200.0, \"formatted\": \"$3200\", \"context\": \"ear. A taxpayer may claim a total credit of up to $3,200, with a general total limit of $1,200, and a separ\"}, {\"amount\": 1200.0, \"formatted\": \"$1200\", \"context\": \"it of up to $3,200, with a general total limit of $1,200, and a separate total limit of $2,000 for electric\"}, {\"amount\": 2000.0, \"formatted\": \"$2000\", \"context\": \"al limit of $1,200, and a separate total limit of $2,000 for electric or natural gas heat pump water heate\"}, {\"amount\": 1200.0, \"formatted\": \"$1200\", \"context\": \"es or boilers that meet certain requirements. The $1,200 general limit also includes additional limitation\"}]", "effective_dates": "[\"2023\", \"2024\", \"2025\"]", "linked_revproc_url": null, "keywords_matched": "[]", "is_inflation_related": false, "is_tax_year_update": false, "jurisdiction_level": "federal", "jurisdiction_code": "US", "_extracted_at": "2025-10-16T20:58:02.533043Z", "_source_url": "https://www.irs.gov/newsroom"}
{"release_id": "9ef0ad6fdb39d6dc", "title": "IRS reminder to disaster area taxpayers with extensions: Parts of 8 states need to file 2023 returns by Nov. 1; others have until Feb. 3 or May 1", "url": "https://www.irs.gov/newsroom/irs-reminder-to-disaster-area-taxpayers-with-extensions-parts-of-8-states-need-to-file-2023-returns-by-nov-1-others-have-until-feb-3-or-may-1", "published_date": "2024-10-15", "content_summary": "IRS reminder to disaster area taxpayers with extensions: Parts of 8 states need to file 2023 returns by Nov. 1; others have until Feb. 3 or May 1", "full_content": "An official website of the United States government A .gov website belongs to an official government organization in the United States. A lock ( )\n            or https:// means you've safely connected to the .gov website. Share sensitive information only on official, secure websites. WASHINGTON — Now that the Oct. 15 extension deadline has come and gone, the Internal Revenue Service today reminded disaster-area taxpayers who received extensions to file their 2023 returns that, depending upon their location, their returns are due on Nov. 1, 2024, Feb. 3, 2025, or May 1, 2025. Eligible taxpayers are individuals and businesses affected by various disasters that occurred during the late spring, summer and early fall of this year. For extension filers, payments on the 2023 tax year returns are not eligible for the additional time because they were originally due last spring before any of these disasters occurred. The IRS normally provides relief, including postponing various tax filing and payment deadlines, for any area designated by the Federal Emergency Management Agency (FEMA) . As long as their address of record is in a disaster-area locality, individual and business taxpayers automatically get the extra time, without having to ask for it. The current list of eligible localities is always available on the disaster relief page on IRS.gov. In addition, the IRS will work with any taxpayer who lives outside the disaster area but whose records necessary to meet a deadline occurring during the postponement period are located in the affected area. Taxpayers qualifying for relief who live outside the disaster should contact the IRS at 866-562-5227 . This also includes workers who assisted with relief activities who are affiliated with a recognized government or philanthropic organization. Taxpayers who live or have a business in Israel, Gaza or the West Bank, and certain other taxpayers affected by the terrorist attacks in the State of Israel have until Sept. 30, 2025, to f", "tax_amounts_json": "[]", "effective_dates": "[\"2024\", \"2025\", \"2023\", \"May\"]", "linked_revproc_url": null, "keywords_matched": "[]", "is_inflation_related": false, "is_tax_year_update": true, "jurisdiction_level": "federal", "jurisdiction_code": "US", "_extracted_at": "2025-10-16T20:58:02.533045Z", "_source_url": "https://www.irs.gov/newsroom"}
{"release_id": "e0383f072f2a0a32", "title": "IRS encourages all taxpayers to sign up for an IP PIN for the 2025 tax season", "url": "https://www.irs.gov/newsroom/irs-encourages-all-taxpayers-to-sign-up-for-an-ip-pin-for-the-2025-tax-season", "published_date": "2024-10-15", "content_summary": "IRS encourages all taxpayers to sign up for an IP PIN for the 2025 tax season", "full_content": "An official website of the United States government A .gov website belongs to an official government organization in the United States. A lock ( )\n            or https:// means you've safely connected to the .gov website. Share sensitive information only on official, secure websites. WASHINGTON — As the 2025 tax season approaches, the IRS encourages all taxpayers to take an important step to safeguard their identity by signing up for an identity protection personal identification number (IP PIN). This simple yet crucial step can provide an added layer of security, helping protect against tax-related identity theft. The IRS encourages taxpayers to sign up for IRS Online Account , which provides a quick and easy way to obtain an IP PIN. Signing up early will ensure taxpayers have extra safety by having an IP PIN to electronically file their returns when the filing season begins in 2025. The IRS encourages people to sign up for an IP PIN before Nov. 23, 2024. After this date, the IP PIN system will undergo maintenance and will not be available again until early January 2025. Signing up for an IP PIN now will ensure that a taxpayer’s identity is protected when the filing season begins. New IP PINs are generated for the 2025 filing season during this period, so online enrollees must retrieve their new IP PIN starting early January 2025. An IP PIN is a six-digit number that prevents someone else from filing a federal tax return using a taxpayer’s Social Security number or Individual Taxpayer Identification Number. It’s a vital tool for ensuring the safety of taxpayers’ personal and financial information. The IP PIN, known only to an individual and the IRS, confirms their identity when they electronically file their tax return, making it much more difficult for thieves to use their information fraudulently. The best way to sign up for an IP PIN is through IRS Online Account . The process requires identity verification, and spouses and dependents can also obtain an IP PIN i", "tax_amounts_json": "[]", "effective_dates": "[\"2025\", \"2024\"]", "linked_revproc_url": null, "keywords_matched": "[]", "is_inflation_related": false, "is_tax_year_update": true, "jurisdiction_level": "federal", "jurisdiction_code": "US", "_extracted_at": "2025-10-16T20:58:02.533046Z", "_source_url": "https://www.irs.gov/newsroom"}
{"release_id": "258cd7793e375490", "title": "Treasury, IRS grant filing exception for tax-exempt organizations from filing new Form 4626, Alternative Minimum Tax - Corporations", "url": "https://www.irs.gov/newsroom/treasury-irs-grant-filing-exception-for-tax-exempt-organizations-from-filing-new-form-4626-alternative-minimum-tax-corporations", "published_date": "2024-10-15", "content_summary": "Treasury, IRS grant filing exception for tax-exempt organizations from filing new Form 4626, Alternative Minimum Tax - Corporations", "full_content": "An official website of the United States government A .gov website belongs to an official government organization in the United States. A lock ( )\n            or https:// means you've safely connected to the .gov website. Share sensitive information only on official, secure websites. WASHINGTON — The Department of the Treasury and the Internal Revenue Service today granted a filing exception for tax-exempt organizations; they do not have to file Form 4626, Alternative Minimum Tax – Corporations PDF , for tax year 2023. The Inflation Reduction Act of 2022 created an alternative minimum tax for corporations – a 15% minimum tax on the adjusted financial statement income (AFSI) of corporations that have average annual AFSI greater than $1 billion, beginning in 2023. For tax-exempt organizations, the corporate alternative minimum tax applies only to the AFSI of any unrelated trades or businesses. Tax-exempt organizations should maintain Form 4626 in their books and records for purposes of documenting whether they are an applicable corporation for purposes of the alternative minimum tax and, if so, for determining any corporate alternative minimum tax liability. In addition, any tax-exempt organization that is liable for the alternative minimum tax must pay the tax and report the amount on Part II, Line 5 of Form 990-T, Exempt Organization Business Income Tax Return . In Notice 2023-7 and in the proposed regulations published on Sept. 13, 2024, Treasury and the IRS provided a simplified method for determining whether a corporation is an applicable corporation, but this method did not take into account the specific AFSI adjustment provided by the statute for tax-exempt organizations. Comments on the proposed regulations are due Dec. 12, 2024. To give taxpayers and the IRS time to consider the comments on the proposed regulations, including comments relating to reporting for tax-exempt entities and on the application of the simplified method for tax-exempt entities, tax-exe", "tax_amounts_json": "[{\"amount\": 1.0, \"formatted\": \"$1\", \"context\": \"ations that have average annual AFSI greater than $1 billion, beginning in 2023. For tax-exempt organi\"}]", "effective_dates": "[\"2024\", \"2022\", \"2023\"]", "linked_revproc_url": null, "keywords_matched": "[\"alternative minimum tax\"]", "is_inflation_related": false, "is_tax_year_update": false, "jurisdiction_level": "federal", "jurisdiction_code": "US", "_extracted_at": "2025-10-16T20:58:02.533048Z", "_source_url": "https://www.irs.gov/newsroom"}
{"release_id": "54ec5bcdad3649f6", "title": "IRS announces launch of pass-through compliance unit in LB&I; new group brings together teams of specialists from across the agency to tackle large or complex exams", "url": "https://www.irs.gov/newsroom/irs-announces-launch-of-pass-through-compliance-unit-in-lbi-new-group-brings-together-teams-of-specialists-from-across-the-agency-to-tackle-large-or-complex-exams", "published_date": "2024-10-15", "content_summary": "IRS announces launch of pass-through compliance unit in LB&I; new group brings together teams of specialists from across the agency to tackle large or complex exams", "full_content": "An official website of the United States government A .gov website belongs to an official government organization in the United States. A lock ( )\n            or https:// means you've safely connected to the .gov website. Share sensitive information only on official, secure websites. WASHINGTON — The Internal Revenue Service today announced the new pass-through field operations unit announced last fall has officially started work in its Large Business and International (LB&I) division to more efficiently conduct audits of pass-through entities. The creation of a new unit specifically devoted to ensuring compliance of pass-throughs of every size and form—including partnerships, S-corporations and trusts—reflects the IRS’s broader efforts to focus more attention and resources on an area that has historically been under-scrutinized. Previously, pass-through exams were divided between LB&I and the Small Business/Self-Employed (SB/SE) division based on the size of the entity. Going forward, revenue agents in pass-through field operations will be assembled into geographically based teams that are responsible for primary exams of pass-through entity returns. LB&I will be responsible for starting pass-through exams, regardless of entity size. SB/SE will continue to examine pass-through entities as part of a related exam of a tax return. Consolidating the case-working expertise and removing the entity-size barrier helps the IRS achieve its goal of increased audit rates in this complex area, streamlines workflows and provides a more consistent experience for taxpayers. \"The establishment of pass-through field operations is a significant step in our goal to increase fairness in enforcement while improving service,” said IRS Commissioner Danny Werfel. \"By using Inflation Reduction Act funding and enhancing our expertise in this area, we will be able to reverse our historically low audit rates for complex arrangements employed by certain high-wealth individuals and large entitie", "tax_amounts_json": "[]", "effective_dates": "[]", "linked_revproc_url": null, "keywords_matched": "[]", "is_inflation_related": false, "is_tax_year_update": false, "jurisdiction_level": "federal", "jurisdiction_code": "US", "_extracted_at": "2025-10-16T20:58:02.533050Z", "_source_url": "https://www.irs.gov/newsroom"}
